app/controllers/api/v1/connections_controller.rb

    def index
        connections = Connection.all
---
SELECT "connections".* FROM "connections"

    def create
        connection = Connection.create!(connection_params)
---
INSERT INTO "connections" ("mentee_id", "mentor_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["mentee_id", 1], ["mentor_id", 9], ["status", "pending"], ["created_at", "2020-02-07 04:03:15.420207"], ["updated_at", "2020-02-07 04:03:15.420207"]]