app/controllers/api/v1/mentees_controller.rb

    def index
        mentees = Mentee.all
---
SELECT "mentees".* FROM "mentees"