app/controllers/api/v1/mentors_controller.rb

SELECT "mentors".* FROM "mentors"
---
    def index
        mentors = Mentor.all